#+TITLE: Finnbyte's Emacs config
#+AUTHOR: Finnbyte
#+PROPERTY: header-args :tangle config.el 

*All of the headings grouped by functionality provided*
| Introduction                                    | Introductes my point of view about Emacs                                       |
|                                                 |                                                                                |
| Graphical User Interface                        | Vanilla Emacs GUI beautification                                               |
| General Emacs Behavior                          | Disabling or enabling design choices in Vanilla Emacs                          |
|                                                 |                                                                                |
| Functions used for variety of stuff             | Functions i've found or created which do useful things                         |
|                                                 |                                                                                |
| Manually loading .el files                      | Adding manually installed .el files to loadpath and set-up                     |
| Setting up manually installed .el files         | Setting up functions or variables in those .el files                           |
|                                                 |                                                                                |
| Initializing package management                 | Initialize vanilla emacs package manager and ensure use-package installed      |
| Install and configure packages with use-package | All installed packages are defined here, and configured.                       |
|                                                 |                                                                                |
** Org-mode
#+begin_src emacs-lisp
(use-package org
  :custom
  (org-startup-indented t)
  (org-startup-folded t)
  ;; Disable pesky confirm on elisp evaluation
  (org-confirm-babel-evaluate nil)
  ;; Source block indentation is wack by default
  (org-src-preserve-indentation nil)
  (org-src-tab-acts-natively t)
  (org-src-strip-leading-and-trailing-blank-lines t)
  (org-edit-src-content-indentation 0)
  :hook (after-save . automatic-babel-tangle))
  :config
  ;; org-babel languages
  (org-babel-do-load-languages 'org-babel-load-languages '((python . t)
                                                           (C . t)
							       (shell . t)))


  ;; Unicode bullets instead of stars on headings
(use-package org-bullets
    :config
      (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

  ;; Evil keybindings for org stuffs
(use-package evil-org
    :ensure t
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))

#+end_src	

#+RESULTS:
| (lambda nil evil-org-mode) | (lambda nil (org-bullets-mode 1)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] |

*** Files
#+begin_src elisp 
"." '(ido-find-file :which-key "Find file")
"/" '(ido-dired :which-key "Find directory")
"f r" '(counsel-recentf :which-key "Recent files")
"f b" '(bookmark-jump :which-key "Browse bookmarks")
"f s" '(save-buffer :which-key "Save current buffer")

;; Alternative command for bookmarks
"DEL" '(bookmark-jump :which-key "Browse bookmarks")
#+end_src

#+RESULTS:
| save-buffer | :which-key | Save current buffer |

